/**
  ******************************************************************************
  * 文件名程: 
  * 作    者: 
  * 版    本: 
  * 编写日期: 
  * 功    能: 
  ******************************************************************************
  */    

#ifndef __POSITION_DRV_H
#define __POSITION_DRV_H

/**********************************包含头文件 **********************************/

#include "main.h"

/************************************宏定义*************************************/

/**********************************结构体定义***********************************/
typedef struct
{
    u16   PosCalculateCnt;            // 位置计算计数    
    u16   ElectricalValMax;           // 电角度最大值
    s32   ElectricalPosThis;          // 本次电角位置
    s32   ElectricalPosLast;          // 上次电角位置
    s32   ElectricalPosChange;        // 单位时间位移
    s32   ElectricalPosSum;           // 绝对电角位置
    s32   MechanicalPosRaw;           // 绝对机械位置
  s32   MechanicalPosSet;           // 目标机械位置
}POSITION_STRUCT;

/***********************************函数声明************************************/

void Calculate_Position(POSITION_STRUCT *p);

#endif

/*********************************END OF FILE***********************************/



